<script>
import TextSection from "./TextSection.svelte";
</script>

{#snippet header()}
    <p>Единственное известное место во вселенной, содержащее жизнь</p>
    <h1>Земля</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>Жизнь, предположительно, появилась на Земле примерно 4,25 млрд лет назад, то есть вскоре после её возникновения. С тех пор биосфера Земли значительно изменила атмосферу и привела к формированию озонового слоя, который вместе с магнитным полем Земли ослабляет вредную для жизни солнечную радиацию, тем самым сохраняя условия существования жизни на ней.</p>
    <p>Приблизительно 70,8 % поверхности планеты занимает Мировой океан, остальную часть поверхности занимают континенты и острова. На материках расположены реки, озёра, подземные воды и льды, которые вместе с Мировым океаном составляют гидросферу. Жидкая вода, необходимая для всех известных жизненных форм, не существует на поверхности какой-либо из известных планет и планетоидов Солнечной системы, кроме Земли.</p>
    <p>Планета является домом примерно для 8,7 млн видов живых существ, включая человека.</p>
</div>
{/snippet}

<TextSection {header} {body}></TextSection>