<script>
import TextSection from "./TextSection.svelte";
</script>

{#snippet header()}
    <p>Cамая близкая к Солнцу планета; бог торговли</p>
    <h1>Меркурий</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>Меркурий получил имя быстрейшего римского бога, к атрибутам которого относятся крылатые шлем и сандали, поскольку движется по небу быстрее всех других планет солнечной системы. Солнце Меркурий облетает всего за 87.97 земных суток.</p>
    <p>Планета сформировалась около 4.5 миллиардов лет назад. У нее есть металлическое ядро, каменистая мантия и твердая кора. Несмотря на то, что Меркурий находится ближе всего к Солнцу, его поверхность не самая горячая в солнечной системе.</p>
</div>
{/snippet}

<TextSection {header} {body}></TextSection>