<script>
import TextSection from "./TextSection.svelte";
</script>

{#snippet header()}
    <p>Крайняя планета солнечной системы; бог морей</p>
    <h1>Нептун</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>Планета была обнаружена 23 сентября 1846 года, став первой планетой, открытой благодаря математическим расчётам. Обнаружение непредсказуемых изменений орбиты Урана породило гипотезу о неизвестной планете, гравитационным возмущающим влиянием которой они и обусловлены. Нептун был найден в пределах предсказанной орбиты.</p>
    <p>В атмосфере Нептуна бушуют самые сильные ветры среди планет Солнечной системы; по разным оценкам, их скорости могут достигать 600 м/с.</p>
</div>
<div class="text-box">
    <p>12 июля 2011 года исполнился ровно один нептунианский год — или 164,79 земного года — с момента открытия Нептуна.</p>
    <p>У Нептуна известно 16 спутников, крупнейший из которых — Тритон.</p>
</div>
{/snippet}

<TextSection {header} {body}></TextSection>