<script>
import TextSection from "./TextSection.svelte";
</script>

{#snippet header()}
    <p>Планета с кольцами, бог времени и земледелия</p>
    <h1>Сатурн</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>Вокруг планеты обращается как минимум 274 спутника, это наибольшее число открытых спутников среди всех планет Солнечной системы. Самый крупный спутник Сатурна — Титан, превосходит по своим размерам планету Меркурий.</p>
    <p>Титан — единственный среди спутников планет Солнечной системы, обладающий собственной плотной атмосферой, и единственный, для которого доказано существование жидкости на поверхности.</p>
</div>
<div class="text-box">
    <p>Сатурн обладает заметной системой колец, состоящей главным образом из частичек льда, меньшего количества тяжёлых элементов и пыли. При диаметре около 250000 км, их толщина не достигает и километра.</p>
    <p>Облака на северном полюсе Сатурна образуют гигантский шестиугольник. Впервые это обнаружено во время пролётов «Вояджера» около Сатурна в 1980-х годах, подобное явление никогда не наблюдалось ни в одном другом месте Солнечной системы. Полного объяснения этому образованию пока нет.</p>
</div>
{/snippet}

<TextSection {header} {body}></TextSection>