<script>
import TextSection from "./TextSection.svelte";
</script>

{#snippet header()}
<p>Всего лишь пылинка во млечном пути</p>
<h1>Солнечная система</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>Представляет собой планетную систему, состоящую из звезды Солнца и небесных тел, включающих в себя восемь планет, пять официально названных карликовых планет, сотни лун и тысячи астероидов и комет.</p>
    <p>Солнечная система сформировалась около 4.6 миллиардов лет назад из газопылевого облака. Её масса составляет около <span style='white-space: nowrap;'>1.9912 × 10<sup>30</sup> кг,</span> 99.86% из которых занимает солнце. Оставшаяся масса почти целиком содержится в восьми планетах.</p>
</div>
<div class="text-box">
    <p>В солнечной системе существуют две области, заполненные так называемыми "малыми телами" — объектами, не являющимися планетами, карликовыми планетами или их спутниками: пояс астероидов, находящийся между Марсом и Юпитеом, и намного более широкий пояс Койпера.</p>
    <p>Тогда как тела пояса астероидов состоят в основном из горных пород и металлов, тела пояса Койпера состоят из метана, аммиака и воды. В поясе Койпера также находится карликовая планета Плутон.</p>
</div>
{/snippet}

<TextSection {header} {body} first={true}></TextSection>