<script>
import TextSection from "./TextSection.svelte";
</script>

{#snippet header()}
    <p>Желтый карлик; центр Солнечной системы</p>
    <h1>Солнце</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>Одна из звезд Млечного Пути, единственная звезда и самое тяжелое тело Солнечной системы, Солнце относится к классу G и подклассу 2V по спектральной классификации. Иными словами, Солнце считается "жёлтой" звездой, а его температура составляет 5000-6000 К.</p>
    <p>Средняя плотность солнца составляет 1.4 г/см<sup>3</sup>. Средний диаметр — 1.392 миллионов км, или 109 диаметров Земли. Ускорение свободного падения на экваторе Солнца почти в 28 раз превышает ускорение свободного падения на Земле.</p>
</div>
<div class="text-box">
    <p>Солнце состоит из нескольких слоев: ядра, в котором идут термоядерные реакции — плотность вещества в нем составляет примерно 150000 кг/м<sup>3</sup>, а температура — более 14 млн К; зоны лучистого переноса, конвективной зоны, фотосферы и хромосферы, а также солнечной короны, состоящей из солнечных вспышек.</p>
    <p>Из внешней части солнечной короны истекает солнечный ветер — поток ионизированных частиц (в основном протонов, электронов и α-частиц), распространяющийся с постепенным уменьшением своей плотности, до границ гелиосферы.</p>
</div>
{/snippet}

<TextSection {header} {body}></TextSection>