<script>
import TextSection from "./TextSection.svelte";
</script>

{#snippet header()}
    <p>Первая планета, обнаруженная при помощи телескопа; бог неба</p>
    <h1>Уран</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>В отличие от газовых гигантов — Сатурна и Юпитера, состоящих в основном из водорода и гелия, в недрах Урана и схожего с ним Нептуна отсутствует металлический водород, но зато много льда. По этой причине эти две планеты выделили в отдельную категорию «ледяных гигантов».</p>
    <p>Уран — самая холодная планетарная атмосфера Солнечной системы с минимальной температурой в 49 К (−224 °C). Полагают, что Уран имеет сложное слоистое строение облаков, где вода составляет нижний слой, а метан — верхний.</p>
</div>
<div class="text-box">
    <p>Ориентация Урана в пространстве отличается от остальных планет Солнечной системы — его ось вращения лежит как бы «на боку» относительно плоскости обращения этой планеты вокруг Солнца. Вследствие этого планета бывает обращена к Солнцу попеременно то северным полюсом, то южным, то экватором, то средними широтами.</p>
</div>
{/snippet}

<TextSection {header} {body}></TextSection>