<script>
import TextSection from "../TextSection.svelte";
</script>

{#snippet header()}
    <p>Самая большая планета солнечной системы; верховный бог грома и неба</p>
    <h1>Юпитер</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>В отличие от предыдущих четырех планет, Юпитер является газовым гигантом, то есть, состоит в основном из водорода и гелия, а также имеет толстый и плотный слой облаков, составляющий по толщине значительную долю радиуса планеты. </p>
    <p>Юпитер — единственная планета, у которой центр масс с Солнцем находится вне Солнца и отстоит от него примерно на 7 % солнечного радиуса.</p>
</div>
{/snippet}

<TextSection {header} {body}></TextSection>