<script>
import TextSection from "../TextSection.svelte";
</script>

{#snippet header()}
    <p>Красная планета; бог войны</p>
    <h1>Марс</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>Планета обладает очень разряженой атмосферой, состоящей в основном из углекислого газа, а также многими уникальными чертами рельефа. В число его особенностей входят ударные кратеры наподобие лунных, а также вулканы, долины, пустыни и полярные ледниковые шапки наподобие земных.</p>
    <p>Масса планеты составляет 10,7 % массы Земли, а по линейному размеру она практически ровно вдвое меньше Земли. Год на Марсе длится 687 земных суток, или около 669 марсианских солнечных суток.</p>
</div>
<div class="text-box">
    <p>По состоянию на 2024 год орбитальная исследовательская группировка на орбите Марса насчитывает семь функционирующих космических аппаратов: «Марс Одиссей», «Марс-экспресс», Mars Reconnaissance Orbiter, MAVEN, ExoMars Trace Gas Orbiter, «Аль-Амаль» и орбитальный аппарат китайской миссии «Тяньвэнь-1». Это больше, чем около любой другой планеты, не считая Землю.</p>
    <p>У Марса есть два естественных спутника — Фобос и Деймос (в переводе с древнегреческого — «страх» и «ужас»)</p>
</div>
{/snippet}

<TextSection {header} {body}></TextSection>