<script>
import TextSection from "../TextSection.svelte";
</script>

{#snippet header()}
    <p>Единственный спутник земли</p>
    <h1>Луна</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>Луна появилась около 4,5 млрд лет назад, немного позже Земли. Существует несколько гипотез происхождения Луны, ни одна из которых не объясняет всех наблюдаемых особенностей химического состава или взаимного движения. Наиболее популярна гипотеза о том, что Луна сформировалась из осколков, оставшихся после «Гигантского столкновения» Земли и Тейи — планеты, схожей по размерам с Марсом.</p>
</div>
<div class='text-box'>
    <p>Гравитационное влияние Луны вызывает на Земле некоторые интересные эффекты. Наиболее известный из них — морские приливы и отливы.</p>
    <p>На сегодняшний день Луна является единственным внеземным астрономическим объектом, на котором побывал человек.</p>
</div>
{/snippet}

<TextSection {header} {body}></TextSection>