<script>
import TextSection from "../TextSection.svelte";
</script>

{#snippet header()}
    <p>Третье по яркости светило земного неба; богиня любви и красоты</p>
    <h1>Венера</h1>
{/snippet}

{#snippet body()}
<div class='text-box'>
    <p>Венера считается «сестрой» Земли по ряду характеристик — например, по массе и размерам — Вы можете <a data-sveltekit-reload href='compare'>сравнить их сами и убедиться в этом.</a></p>
    <p>Её яркость достигает видимой звёздной величины и является достаточной, чтобы ночью отбрасывать различимые тени. Изредка Венера видна невооружённым глазом и в светлое время суток.</p>
</div>
<div class="text-box">
    <p>Венера имеет плотную атмосферу, состоящую более чем на 96 % из углекислого газа. Атмосферное давление на поверхности планеты в 92 раза больше, чем на поверхности Земли, и примерно равно давлению воды на глубине 900 метров.</p>
    <p>Средняя температура поверхности Венеры — 735 К (462 °C), что делает её самой горячей планетой в Солнечной системе, несмотря на то, что Меркурий находится ближе к Солнцу</p>
</div>
{/snippet}

<TextSection {header} {body}></TextSection>